In [133]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

## Danny's Diner ##

In [134]:
#load data
membersdf = pd.read_csv('./members.csv')
membersdf.head()

  customer_id   join_date
0           A  07/01/2021
1           B  09/01/2021

In [135]:
menudf = pd.read_csv('./menu.csv')
menudf.head()

   product_id product_name  price
0           1        sushi     10
1           2        curry     15
2           3        ramen     12

In [136]:
salesdf = pd.read_csv('./sales.csv')
salesdf

   customer_id  order_date  product_id
0            A  01/01/2021           1
1            A  01/01/2021           2
2            A  07/01/2021           2
3            A  10/01/2021           3
4            A  11/01/2021           3
5            A  11/01/2021           3
6            B  01/01/2021           2
7            B  02/01/2021           2
8            B  04/01/2021           1
9            B  11/01/2021           1
10           B  16/01/2021           3
11           B  01/02/2021           3
12           C  01/01/2021           3
13           C  01/01/2021           3
14           C  07/01/2021           3

What is the total amount each customer spent at the restaurant?

In [137]:
sales_menudf = pd.merge(salesdf, menudf, on='product_id', how='left')
sales_menudf.head()

  customer_id  order_date  product_id product_name  price
0           A  01/01/2021           1        sushi     10
1           A  01/01/2021           2        curry     15
2           A  07/01/2021           2        curry     15
3           A  10/01/2021           3        ramen     12
4           A  11/01/2021           3        ramen     12

In [138]:
date_sales_menudf = sales_menudf.groupby('customer_id').sum('price')
date_sales_menudf.drop(columns='product_id').head()

             price
customer_id
A               76
B               74
C               36

How many days has each customer visited the restaurant?

In [139]:
days = pd.DataFrame(salesdf.drop(columns='product_id'))
days

   customer_id  order_date
0            A  01/01/2021
1            A  01/01/2021
2            A  07/01/2021
3            A  10/01/2021
4            A  11/01/2021
5            A  11/01/2021
6            B  01/01/2021
7            B  02/01/2021
8            B  04/01/2021
9            B  11/01/2021
10           B  16/01/2021
11           B  01/02/2021
12           C  01/01/2021
13           C  01/01/2021
14           C  07/01/2021

In [140]:
days = days.drop_duplicates().groupby('customer_id').count()
days

             order_date
customer_id
A                     4
B                     6
C                     2

What was the first item from the menu purchased by each customer?

In [150]:
first_item = sales_menudf.loc[sales_menudf['order_date'] == '01/01/2021']
first_item = first_item.drop_duplicates()
first_item = first_item.drop(index=1)
first_item

   customer_id  order_date  product_id product_name  price
0            A  01/01/2021           1        sushi     10
6            B  01/01/2021           2        curry     15
12           C  01/01/2021           3        ramen     12

What is the most purchased item on the menu and how many times was it purchased by all customers?

In [152]:
sales_menudf.product_name.value_counts()

ramen    8
curry    4
sushi    3
Name: product_name, dtype: int64

Which item was the most popular for each customer?

In [164]:
customers= ['A', 'B', 'C']

for i in customers:
    print(f" {i} {(sales_menudf.loc[sales_menudf['customer_id'] == i].value_counts('product_name'))}")

 A product_name
ramen    3
curry    2
sushi    1
dtype: int64
 B product_name
curry    2
ramen    2
sushi    2
dtype: int64
 C product_name
ramen    3
dtype: int64

Which item was purchased first by the customer after they became a member?

Which item was purchased just before the customer became a member?

What is the total items and amount spent for each member before they became a member?

If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?